//Задачи 1 и 2
// Инициализация переменных
let algebra;
let geography;
let physics;
let name;
let message;

//Присвоение оценок
algebra = 5;
geography = 4;
physics = 5;
name = "Владимир";

//Составление приветственного сообщения
message = `Привет, мир! Меня зовут ${name}.`;

//Подсчет среднего
let avg = (algebra + geography + physics) / 3;

//Вывод в консоль
console.log(message);
console.log("Средняя оценка по трем предметам: " + avg);

//------------------------------------------------------------------------------
console.log("\n\n\n----------------------------------------------------\n\n\n")
//Задача 3
//Инициализация переменных
let x;
let y;
let z;

//Присвоение значений
x = 2;
y = 22;
z = 0;

//Решение уравнения
result = x * y + 5 * z + x - 1;

//Вывод в консоль
console.log("Результат уравнения: " + result);
